---
kind: type
id: T:Autodesk.Revit.DB.ElementLogicalFilter
source: html/3b8d6b55-0cab-1810-1188-840800e5eaa2.htm
---
# Autodesk.Revit.DB.ElementLogicalFilter

A filter used to logically combine two or more filters.

## Syntax (C#)
```csharp
public class ElementLogicalFilter : ElementFilter
```

## Remarks
The component filters may be reordered by Revit to cause the quickest acting filters to be evaluated first.